Revit 2027 API
Family.CurtainPanelTilePattern Property
 For Curtain Panel families, the choice of tile pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TilePatternsBuiltIn CurtainPanelTilePattern { get; }
Public ReadOnly Property CurtainPanelTilePattern As TilePatternsBuiltIn
	Get
public:
property TilePatternsBuiltIn CurtainPanelTilePattern {
	TilePatternsBuiltIn get ();
}
member CurtainPanelTilePattern : TilePatternsBuiltIn with get
Property Value
TilePatternsBuiltIn
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if this family is not a Curtain Panel family.
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace